:PROPERTIES:
:last-accessed: 12/29/22
:hash:     6ab309a1c85986ebb7b1a852f8eda80c1dfa6a96
:last-modified: 12/29/22
:END:
#+title: Quickstart

The Good Org Roam Development Environment (GORDE) provides a simple set of Org Roam
templates & ~dir-locals.el~ configurations to create reproducible test environments for
Org Roam development.

The goal of this repo is to provide a stable set of templates to generate realistic Org
Roam instances that facilitate safer & more efficient development of Org Roam Extensions.

** Debugger.org
Work in progress.

To simplify the process of reading some common values sought during development, the
Debugger.org file is regularly updated with stats about this development Org Roam
instances.

Properties are human readable, and ephemeral. The file updates based on a file-watcher
targeting the Gorde directory.
#+begin_src elisp
(defun update-debug-dashboard (&optional event debug-dash-file)
  "Update the DEBUG-DASH-FIlE file when EVENT received."
  (message "Type of Event:\t%S" (type-of event))
  (message "test for dupes.....")
  (message "Event:\t%S" event)
                                        ; Find org roam file
                                        ; For each debugging property
                                        ; find the appropriate heading
                                        ; insert new data
                                        ; save & close file
  )

(setq gorde-file-watch-descriptor (file-notify-add-watch
 project-root-path
 '(change attribute-change)
 'update-debug-dashboard))
#+end_src

#+RESULTS:
: (1 . 5)

#+begin_src elisp
(file-notify-rm-watch  gorde-file-watch-descriptor)
#+end_src

